{
  "metadata": {
    "source_file": "src/middlewares/global_mw.ts",
    "path": "docs/middlewares/global_mw.md",
    "type": "module"
  },
  "purpose": "Provides comprehensive request validation middleware for Express applications, including mandatory and optional parameter validation, and configurable request logging. Ensures that incoming requests meet specified requirements before reaching route handlers.",
  "dependencies": [
    "json_failed - Creates standardized error response objects for validation failures",
    "MandatoryObject - Interface defining validation rules for a single parameter",
    "MandatoryParams - Interface containing optional arrays of body and header validation rules",
    "LogRequests - Interface defining flags for which request parts to log",
    "MW - Express middleware type definition",
    "logger - Logging manager for request logging",
    "Request, Response, NextFunction, RequestHandler - Standard Express types"
  ],
  "sections": [
    {
      "title": "Exports",
      "exports": [
        {
          "name": "mandatory",
          "signature": "mandatory({ body, headers }: MandatoryParams): MW",
          "type": "function",
          "description": "Middleware factory that creates Express middleware to enforce mandatory parameter validation. All specified parameters must be present and pass validation rules.",
          "parameters": [
            {
              "name": "body",
              "type": "MandatoryObject[]",
              "optional": true,
              "description": "Array of validation rules for request body parameters"
            },
            {
              "name": "headers",
              "type": "MandatoryObject[]",
              "optional": true,
              "description": "Array of validation rules for request header parameters"
            }
          ],
          "returns": "Express middleware function MW",
          "behavior": [
            "Validates all specified body parameters against their rules",
            "Validates all specified header parameters against their rules",
            "If any validation fails, responds immediately with json_failed error and does not call next()",
            "If all validations pass, calls next() to continue to the next middleware/route handler",
            "Uses validateParameter internally with is_mandatory = true"
          ],
          "examples": [
            {
              "code": "app.post('/api/users',\n  mandatory({\n    body: [\n      { key: 'email', type: 'string', length: 5 },\n      { key: 'age', type: 'number' }\n    ],\n    headers: [\n      { key: 'authorization', type: 'string' }\n    ]\n  }),\n  (req, res) => {\n    // All parameters validated and available here\n  }\n);",
              "language": "typescript"
            }
          ]
        },
        {
          "name": "optional",
          "signature": "optional({ body, headers }: MandatoryParams): MW",
          "type": "function",
          "description": "Middleware factory that creates Express middleware to validate optional parameters. Only validates parameters that are present; missing parameters are allowed.",
          "parameters": [
            {
              "name": "body",
              "type": "MandatoryObject[]",
              "optional": true,
              "description": "Array of validation rules for request body parameters"
            },
            {
              "name": "headers",
              "type": "MandatoryObject[]",
              "optional": true,
              "description": "Array of validation rules for request header parameters"
            }
          ],
          "returns": "Express middleware function MW",
          "behavior": [
            "Only validates parameters that exist in the request",
            "If a parameter is undefined, validation is skipped (unlike mandatory)",
            "If a parameter exists but fails validation, responds with json_failed error",
            "Uses the same validation rules as mandatory but with is_mandatory = false",
            "If all validations pass (or parameters are missing), calls next()"
          ],
          "examples": [
            {
              "code": "app.post('/api/users',\n  optional({\n    body: [\n      { key: 'phone', type: 'string', length: 10 },\n      { key: 'metadata', type: 'object', required_keys: ['source'] }\n    ]\n  }),\n  (req, res) => {\n    // phone and metadata are optional, but if present they're validated\n  }\n);",
              "language": "typescript"
            }
          ]
        },
        {
          "name": "request_logger",
          "signature": "request_logger(log_requests: LogRequests): RequestHandler",
          "type": "function",
          "description": "Middleware factory that creates Express middleware for conditional request logging.",
          "parameters": [
            {
              "name": "log_requests",
              "type": "LogRequests",
              "description": "Configuration object with boolean flags: url, headers, query, body"
            }
          ],
          "returns": "Express RequestHandler middleware",
          "behavior": [
            "Logs request information based on the provided flags",
            "Always logs the method and URL if url flag is true: \"GET /api/users\"",
            "Logs headers if headers flag is true: \"Headers: { authorization: '...' }\"",
            "Logs query parameters if query flag is true: \"Query: { page: '1' }\"",
            "Logs body only for POST, PUT, PATCH methods if body flag is true: \"Body: { email: '...' }\"",
            "Uses logger.log() for all logging",
            "Always calls next() to continue the middleware chain"
          ],
          "examples": [
            {
              "code": "app.use(request_logger({\n  url: true,\n  headers: true,\n  body: true,\n  query: true\n}));",
              "language": "typescript"
            }
          ]
        }
      ]
    }
  ],
  "context": [
    "These middlewares are used throughout the application to:",
    "Input Validation - Ensure request data meets API requirements before processing",
    "Type Safety - Validate data types at runtime before they reach route handlers",
    "Error Prevention - Catch invalid data early and return clear error messages",
    "Request Logging - Provide configurable logging for debugging and monitoring",
    "API Consistency - Standardize validation and error responses across all endpoints"
  ],
  "best_practices": [
    "Use mandatory for required fields - Don't rely on route handlers to check for required fields",
    "Use optional for optional fields - Validate optional fields if they're provided",
    "Be specific with validation rules - Use length constraints and type checks to catch errors early",
    "Use request_logger judiciously - Don't log sensitive data in production",
    "Combine with auth middlewares - Use validation before authentication to fail fast",
    "Provide clear error messages - The validation errors are returned to clients, so they should be descriptive"
  ]
}
