{
  "metadata": {
    "source_file": "src/middlewares/trim_mw.ts",
    "path": "docs/middlewares/trim_mw.md",
    "type": "module"
  },
  "purpose": "Provides a middleware function that automatically trims whitespace from all string values in request bodies. This ensures consistent data handling by removing leading and trailing whitespace from user input before it reaches route handlers.",
  "dependencies": [
    "trim_strings - Recursively trims all string values in an object",
    "MW - Express middleware type definition"
  ],
  "sections": [
    {
      "title": "Exports",
      "exports": [
        {
          "name": "trim_body_middleware",
          "signature": "trim_body_middleware(): MW",
          "type": "function",
          "description": "Middleware factory that returns an Express middleware function to trim all string values in the request body.",
          "returns": "Express middleware function MW",
          "behavior": [
            "Checks if req.body exists and is an object",
            "If req.body is an object, recursively processes it using trim_strings helper to trim all string values",
            "Replaces req.body with the trimmed version",
            "Calls next() to continue to the next middleware/route handler",
            "If req.body is not an object or doesn't exist, still calls next() (no error thrown)"
          ],
          "examples": [
            {
              "code": "app.use(trim_body_middleware());\n\napp.post('/api/users', trim_body_middleware(), (req, res) => {\n  // req.body.email and all other string fields are trimmed\n  const email = req.body.email; // \"  user@example.com  \" becomes \"user@example.com\"\n});",
              "language": "typescript"
            }
          ]
        }
      ]
    }
  ],
  "context": [
    "This middleware is used in server bootstrap to normalize input payloads before they reach route handlers. It helps:",
    "Data Consistency - Ensures all string inputs are trimmed, preventing issues with leading/trailing whitespace",
    "Database Integrity - Prevents storing strings with unwanted whitespace in the database",
    "User Experience - Handles cases where users accidentally include spaces when copying/pasting or typing",
    "Validation - Works well with validation middlewares like mandatory - trimmed values are validated after trimming",
    "Normalization - Standardizes input data format across all endpoints"
  ],
  "best_practices": [
    "Apply Early - Use trim_body_middleware() before validation middlewares so trimmed values are validated",
    "Global Application - Consider applying globally if all endpoints should trim input",
    "Combine with Validation - Use with mandatory or optional middlewares for complete input sanitization",
    "Be Aware of Edge Cases - Empty strings become empty strings (not null), whitespace-only strings become empty strings"
  ]
}
