{
  "metadata": {
    "source_file": "src/managers",
    "path": "docs/managers/README.md",
    "type": "directory_overview"
  },
  "purpose": "Overview of singleton managers that provide shared state and cross-cutting utilities used by helpers and middlewares.",
  "sections": [
    {
      "title": "Contents",
      "description": "This directory contains singleton managers that provide shared state and cross-cutting utilities used by helpers and middlewares. All managers use the singleton pattern to ensure consistent behavior across the application.",
      "categories": [
        {
          "name": "Modules",
          "modules": [
            {
              "name": "index.ts",
              "description": "Barrel export file that re-exports all manager modules for convenient importing"
            },
            {
              "name": "cache_manager.ts",
              "description": "Singleton in-memory cache manager for storing arrays and objects by key. Provides fast access to frequently accessed data that is populated by Firebase snapshots or Redis subscriptions. Data persists for the lifetime of the server process."
            },
            {
              "name": "logger_manager.ts",
              "description": "Singleton logger manager providing timestamped logging with intelligent formatting, Axios-aware error handling, and table formatting for structured data. All logs include Israel timezone timestamps (Asia/Jerusalem) in format DD/MM/YYYY HH:mm:ss.SS."
            },
            {
              "name": "translation_manager.ts",
              "description": "Singleton translation manager providing cached translation lookups for UI messages, SMS messages, and email content. Supports multiple languages and scopes with fallback to key names when translations are missing. Translations are stored in nested object structure keyed by scope, language, and entity/key."
            }
          ]
        }
      ]
    }
  ],
  "context": [
    "Managers provide shared state and cross-cutting utilities used by helpers and middlewares. All managers use the singleton pattern to ensure:",
    "Consistent Behavior - Single shared instance across the entire application",
    "Memory Efficiency - Single cache instance, single logger instance, single translation cache",
    "Thread Safety - Safe access in Node.js single-threaded event loop"
  ],
  "best_practices": [
    "Cache Manager: Use array cache for collections accessed sequentially, Use object cache for collections accessed by ID, Always provide default values for object access, Don't mutate cached arrays/objects directly (create copies)",
    "Logger Manager: Use descriptive messages, Include relevant data for debugging, Avoid logging sensitive information, Use appropriate log level (log/error/warn)",
    "Translation Manager: Use consistent entity and key naming, Provide translations for all supported languages, Handle missing translations gracefully, Cache is updated automatically by snapshots"
  ]
}
