{
  "metadata": {
    "source_file": "src/helpers/redis",
    "path": "docs/helpers/redis/README.md",
    "type": "directory_overview"
  },
  "purpose": "Overview of Redis integration helpers for cache hydration and live updates using Redis Pub/Sub while preserving compatibility with Firebase snapshot flows.",
  "sections": [
    {
      "title": "Contents",
      "description": "This directory contains Redis integration helpers for cache hydration and live updates using Redis Pub/Sub while preserving compatibility with Firebase snapshot flows.",
      "categories": [
        {
          "name": "Modules",
          "modules": [
            {
              "name": "index.ts",
              "description": "Barrel export file that re-exports all Redis helper modules for convenient importing"
            },
            {
              "name": "initialize.ts",
              "description": "Redis client initialization with dual-client architecture (commander for read/write, listener for Pub/Sub), connection management, retry logic, and automatic subscription setup. Provides connection status flags and accessor functions for both clients."
            },
            {
              "name": "keys.ts",
              "description": "Redis key and pattern utilities for building consistent key names, collection patterns, update channels, and key scanning operations using SCAN command. Ensures consistent key naming across the application."
            },
            {
              "name": "snapshot.ts",
              "description": "Redis Pub/Sub snapshot integration with automatic fallback to Firebase snapshots. Provides the same cache parsing interface as Firebase snapshots for seamless data source switching. Validates configurations, loads initial data from Redis, and subscribes to update channels."
            }
          ]
        }
      ]
    }
  ],
  "context": [
    "Redis helpers allow cache hydration and live updates using Redis Pub/Sub while preserving compatibility with Firebase snapshot flows. The Redis integration provides:",
    "Dual-Client Architecture - Separate clients for commands and subscriptions (Redis clients in subscriber mode cannot execute regular commands)",
    "Automatic Fallback - Falls back to Firebase when Redis unavailable or unsupported",
    "Real-time Updates - Pub/Sub for live cache updates",
    "Consistent Interface - Same parsing interface as Firebase snapshots",
    "Configuration-Driven - Settings determine data source"
  ],
  "best_practices": [
    "Always call init_redis() during server startup",
    "Check connection flags before using Redis operations",
    "Handle Redis unavailability gracefully (automatic fallback)",
    "Use commander for all read/write operations",
    "Don't use listener for regular commands",
    "Configure cache_collections_config in nx-settings for Redis snapshots"
  ]
}
