{
  "metadata": {
    "source_file": "src/types",
    "path": "docs/types/README.md",
    "type": "directory_overview"
  },
  "purpose": "Overview of TypeScript type definitions, interfaces, and enums used throughout the Akeyless server commons package. These types ensure type safety, consistency, and provide clear contracts for all modules including helpers, managers, and middlewares.",
  "sections": [
    {
      "title": "Contents",
      "categories": [
        {
          "name": "types/ - Type Aliases",
          "description": "Core type definitions for HTTP responses, middleware, routes, Firebase operations, and application-level helpers.",
          "modules": [
            {
              "name": "types/global.ts",
              "description": "Core types for Express middleware, routes, JSON responses, and app helpers. Exports: JsonOK<T>, JsonFailed, MW, Service, Route, MainRouter, AddAuditRecord, LangOptions, EntityOptions"
            },
            {
              "name": "types/firebase_types.ts",
              "description": "Firebase Firestore query and snapshot types. Exports: Query function types (QueryDocument, QueryDocuments, etc.), Snapshot types (OnSnapshotConfig, Snapshot, etc.), WhereCondition interface, InitSnapshotsOptions interface"
            }
          ]
        },
        {
          "name": "interfaces/ - TypeScript Interfaces",
          "description": "Interfaces for configuration objects, data models, and middleware options.",
          "modules": [
            {
              "name": "interfaces/global.ts",
              "description": "Middleware and app configuration interfaces. Exports: MandatoryObject, MandatoryParams, LogRequests, AppOptions"
            },
            {
              "name": "interfaces/email.ts",
              "description": "Email data models. Exports: EmailData, EmailAttachment, EmailSettings"
            }
          ]
        },
        {
          "name": "enums/ - Enumerations",
          "description": "Shared enums and service name type definitions.",
          "modules": [
            {
              "name": "enums/global.ts",
              "description": "Platform-wide enums. Exports: SimProvider, NxServiceName, NxServiceNameMap"
            }
          ]
        },
        {
          "name": "index.ts - Barrel Export",
          "description": "Barrel export file that re-exports all types, interfaces, and enums for convenient importing."
        }
      ]
    }
  ],
  "context": [
    "These shared types provide:",
    "Type Safety - Compile-time type checking across all modules",
    "Consistency - Standardized types ensure consistent API shapes",
    "IntelliSense - Better IDE autocomplete and documentation",
    "Refactoring Safety - TypeScript catches breaking changes",
    "Documentation - Types serve as inline documentation"
  ]
}
